jankaluza/qsimkit/QSimKit/MCU/MSP430/CPU/Variants/msp430x15x.cpp
#ifndef MSP430_NO_HWMUL
#define MSP430_NO_HWMUL 1
#endif
#ifndef ADC12IV_
#define ADC12IV_ 0x01A8
#endif
#ifndef ADC12IV
#define ADC12IV 0x01A8
#endif
#ifndef WAIT
#define WAIT 0x0008
#endif
#ifndef __SIZEOF_WINT_T__
#define __SIZEOF_WINT_T__ 2
#endif
#ifndef __SIZEOF_WINT_T_
#define __SIZEOF_WINT_T_ 2
#endif
#ifndef OUTMOD_TOGGLE_RESET
#define OUTMOD_TOGGLE_RESET OUTMOD_2
#endif
#ifndef FSSEL_ACLK
#define FSSEL_ACLK FSSEL_0
#endif
#ifndef UMCTL0_
#define UMCTL0_ 0x0073
#endif
#ifndef UMCTL0
#define UMCTL0 0x0073
#endif
#ifndef DAC12_1DAT_
#define DAC12_1DAT_ 0x01CA
#endif
#ifndef DAC12_1DAT
#define DAC12_1DAT 0x01CA
#endif
#ifndef BIT0
#define BIT0 0x0001
#endif
#ifndef URXEIE
#define URXEIE 0x08
#endif
#ifndef P3OUT_
#define P3OUT_ 0x0019
#endif
#ifndef P3OUT
#define P3OUT 0x0019
#endif
#ifndef DMASRCBYTE
#define DMASRCBYTE 0x0040
#endif
#ifndef DIVA0
#define DIVA0 0x10
#endif
#ifndef DIVA1
#define DIVA1 0x20
#endif
#ifndef __GXX_ABI_VERSION
#define __GXX_ABI_VERSION 1002
#endif
#ifndef BIT6
#define BIT6 0x0040
#endif
#ifndef __msp430_headers_timera_h__
#define __msp430_headers_timera_h__ 
#endif
#ifndef __msp430_headers_timera_h_
#define __msp430_headers_timera_h_ 
#endif
#ifndef SHS_TACCR1
#define SHS_TACCR1 SHS_1
#endif
#ifndef TASSEL0
#define TASSEL0 0x0100
#endif
#ifndef TASSEL1
#define TASSEL1 0x0200
#endif
#ifndef TASSEL2
#define TASSEL2 0x0400
#endif
#ifndef P1IE_
#define P1IE_ 0x0025
#endif
#ifndef P1IE
#define P1IE 0x0025
#endif
#ifndef P3SEL_
#define P3SEL_ 0x001B
#endif
#ifndef P3SEL
#define P3SEL 0x001B
#endif
#ifndef BUSY
#define BUSY 0x0001
#endif
#ifndef TIMERB1_VECTOR
#define TIMERB1_VECTOR 24
#endif
#ifndef TA0IV_
#define TA0IV_ 0x012E
#endif
#ifndef TA0IV
#define TA0IV 0x012E
#endif
#ifndef I2CSSEL_ACLK
#define I2CSSEL_ACLK I2CSSEL_1
#endif
#ifndef DAC12CALON
#define DAC12CALON 0x0200
#endif
#ifndef ADC12MEM
#define ADC12MEM ADC12MEM_
#endif
#ifndef __msp430_have_port4
#define __msp430_have_port4 
#endif
#ifndef TBCCR1_
#define TBCCR1_ 0x0194
#endif
#ifndef TBCCR1
#define TBCCR1 0x0194
#endif
#ifndef TXWAKE
#define TXWAKE 0x04
#endif
#ifndef MC_STOP
#define MC_STOP MC_0
#endif
#ifndef __MSP430
#define __MSP430 1
#endif
#ifndef CACTL1_
#define CACTL1_ 0x0059
#endif
#ifndef CACTL1
#define CACTL1 0x0059
#endif
#ifndef TBCCR2_
#define TBCCR2_ 0x0196
#endif
#ifndef TBCCR2
#define TBCCR2 0x0196
#endif
#ifndef CACTL24
#define CACTL24 0x10
#endif
#ifndef CACTL25
#define CACTL25 0x20
#endif
#ifndef CACTL26
#define CACTL26 0x40
#endif
#ifndef CACTL27
#define CACTL27 0x80
#endif
#ifndef I2CIFG_
#define I2CIFG_ 0x0051
#endif
#ifndef I2CIFG
#define I2CIFG 0x0051
#endif
#ifndef CACTL2_
#define CACTL2_ 0x005A
#endif
#ifndef CACTL2
#define CACTL2 0x005A
#endif
#ifndef TBCCTL0_
#define TBCCTL0_ 0x0182
#endif
#ifndef TBCCTL0
#define TBCCTL0 0x0182
#endif
#ifndef SREF_AVCC_VEREF
#define SREF_AVCC_VEREF SREF_4
#endif
#ifndef __MSP430_IVCNT__
#define __MSP430_IVCNT__ 16
#endif
#ifndef __MSP430_IVCNT_
#define __MSP430_IVCNT_ 16
#endif
#ifndef TBCCTL1_
#define TBCCTL1_ 0x0184
#endif
#ifndef TBCCTL1
#define TBCCTL1 0x0184
#endif
#ifndef __MSP430_HAS_COMPA__
#define __MSP430_HAS_COMPA__ 
#endif
#ifndef __MSP430_HAS_COMPA_
#define __MSP430_HAS_COMPA_ 
#endif
#ifndef TBCCTL2_
#define TBCCTL2_ 0x0186
#endif
#ifndef TBCCTL2
#define TBCCTL2 0x0186
#endif
#ifndef WDTSSEL
#define WDTSSEL 0x0004
#endif
#ifndef FCTL1_
#define FCTL1_ 0x0128
#endif
#ifndef FCTL1
#define FCTL1 0x0128
#endif
#ifndef SSEL_ACLK
#define SSEL_ACLK SSEL_1
#endif
#ifndef WDTIS_0
#define WDTIS_0 0x0000
#endif
#ifndef WDTIS_1
#define WDTIS_1 0x0001
#endif
#ifndef WDTIS_2
#define WDTIS_2 0x0002
#endif
#ifndef WDTIS_3
#define WDTIS_3 0x0003
#endif
#ifndef FCTL2_
#define FCTL2_ 0x012A
#endif
#ifndef FCTL2
#define FCTL2 0x012A
#endif
#ifndef __msp430_headers_dac12_h
#define __msp430_headers_dac12_h 
#endif
#ifndef FCTL3_
#define FCTL3_ 0x012C
#endif
#ifndef FCTL3
#define FCTL3 0x012C
#endif
#ifndef P1IN_
#define P1IN_ 0x0020
#endif
#ifndef P1IN
#define P1IN 0x0020
#endif
#ifndef DMA0SZ_
#define DMA0SZ_ 0x01E6
#endif
#ifndef DMA0SZ
#define DMA0SZ 0x01E6
#endif
#ifndef DMAREQ
#define DMAREQ 0x0001
#endif
#ifndef DIVM0
#define DIVM0 0x10
#endif
#ifndef DIVM1
#define DIVM1 0x20
#endif
#ifndef TIMERA0_VECTOR
#define TIMERA0_VECTOR 12
#endif
#ifndef I2CSCLH_
#define I2CSCLH_ 0x0074
#endif
#ifndef I2CSCLH
#define I2CSCLH 0x0074
#endif
#ifndef DCOCTL_
#define DCOCTL_ 0x0056
#endif
#ifndef DCOCTL
#define DCOCTL 0x0056
#endif
#ifndef CPUOFF
#define CPUOFF 0x0010
#endif
#ifndef WDTNMIES
#define WDTNMIES 0x0040
#endif
#ifndef DMA1TSEL3
#define DMA1TSEL3 0x0080
#endif
#ifndef __DEC128_MIN__
#define __DEC128_MIN__ 1E-6143DL
#endif
#ifndef __DEC128_MIN_
#define __DEC128_MIN_ 1E-6143DL
#endif
#ifndef __REGISTER_PREFIX__
#define __REGISTER_PREFIX__ 
#endif
#ifndef __REGISTER_PREFIX_
#define __REGISTER_PREFIX_ 
#endif
#ifndef DMAONFETCH
#define DMAONFETCH 0x0004
#endif
#ifndef __DBL_HAS_DENORM__
#define __DBL_HAS_DENORM__ 1
#endif
#ifndef __DBL_HAS_DENORM_
#define __DBL_HAS_DENORM_ 1
#endif
#ifndef TXDMAEN
#define TXDMAEN 0x40
#endif
#ifndef I2CPSC_
#define I2CPSC_ 0x0073
#endif
#ifndef I2CPSC
#define I2CPSC 0x0073
#endif
#ifndef U0RXBUF_
#define U0RXBUF_ 0x0076
#endif
#ifndef U0RXBUF
#define U0RXBUF 0x0076
#endif
#ifndef DAC12_0DAT_
#define DAC12_0DAT_ 0x01C8
#endif
#ifndef DAC12_0DAT
#define DAC12_0DAT 0x01C8
#endif
#ifndef SHT1_DIV128
#define SHT1_DIV128 SHT1_6
#endif
#ifndef P2OUT_
#define P2OUT_ 0x0029
#endif
#ifndef P2OUT
#define P2OUT 0x0029
#endif
#ifndef PORT1_VECTOR
#define PORT1_VECTOR 8
#endif
#ifndef ADC12SSEL_SMCLK
#define ADC12SSEL_SMCLK ADC12SSEL_3
#endif
#ifndef I2CSCLL_
#define I2CSCLL_ 0x0075
#endif
#ifndef I2CSCLL
#define I2CSCLL 0x0075
#endif
#ifndef FRKEY
#define FRKEY 0x9600
#endif
#ifndef __MSP430_HAS_TA3__
#define __MSP430_HAS_TA3__ 
#endif
#ifndef __MSP430_HAS_TA3_
#define __MSP430_HAS_TA3_ 
#endif
#ifndef DIVS0
#define DIVS0 0x02
#endif
#ifndef DIVS1
#define DIVS1 0x04
#endif
#ifndef __MSP430_HAS_PORT1__
#define __MSP430_HAS_PORT1__ 
#endif
#ifndef __MSP430_HAS_PORT1_
#define __MSP430_HAS_PORT1_ 
#endif
#ifndef __NO_INLINE__
#define __NO_INLINE__ 1
#endif
#ifndef __NO_INLINE_
#define __NO_INLINE_ 1
#endif
#ifndef DMA0TSEL0
#define DMA0TSEL0 0x0001
#endif
#ifndef DMA0TSEL1
#define DMA0TSEL1 0x0002
#endif
#ifndef DMA0TSEL2
#define DMA0TSEL2 0x0004
#endif
#ifndef DMA0TSEL3
#define DMA0TSEL3 0x0008
#endif
#ifndef __MSP430_HAS_DAC12_3__
#define __MSP430_HAS_DAC12_3__ 
#endif
#ifndef __MSP430_HAS_DAC12_3_
#define __MSP430_HAS_DAC12_3_ 
#endif
#ifndef ADC12SSEL_MCLK
#define ADC12SSEL_MCLK ADC12SSEL_2
#endif
#ifndef SCCI
#define SCCI 0x0400
#endif
#ifndef P2SEL_
#define P2SEL_ 0x002E
#endif
#ifndef P2SEL
#define P2SEL 0x002E
#endif
#ifndef __FLT_MANT_DIG__
#define __FLT_MANT_DIG__ 24
#endif
#ifndef __FLT_MANT_DIG_
#define __FLT_MANT_DIG_ 24
#endif
#ifndef __VERSION__
#define __VERSION__ "4.5.3"
#endif
#ifndef __VERSION_
#define __VERSION_ "4.5.3"
#endif
#ifndef RXDMAEN
#define RXDMAEN 0x80
#endif
#ifndef U0BR0_
#define U0BR0_ 0x0074
#endif
#ifndef U0BR0
#define U0BR0 0x0074
#endif
#ifndef LISTEN
#define LISTEN 0x08
#endif
#ifndef WDTCTL_
#define WDTCTL_ 0x0120
#endif
#ifndef WDTCTL
#define WDTCTL 0x0120
#endif
#ifndef U0BR1_
#define U0BR1_ 0x0075
#endif
#ifndef U0BR1
#define U0BR1 0x0075
#endif
#ifndef UBR0_
#define UBR0_ 0x0074
#endif
#ifndef UBR0
#define UBR0 0x0074
#endif
#ifndef I2CIV_TXRDY
#define I2CIV_TXRDY 0x0C
#endif
#ifndef SCG0
#define SCG0 0x0040
#endif
#ifndef SCG1
#define SCG1 0x0080
#endif
#ifndef SHT1_DIV192
#define SHT1_DIV192 SHT1_7
#endif
#ifndef UBR1_
#define UBR1_ 0x0075
#endif
#ifndef UBR1
#define UBR1 0x0075
#endif
#ifndef GCIFG
#define GCIFG 0x40
#endif
#ifndef TA0CCTL0_
#define TA0CCTL0_ 0x0162
#endif
#ifndef TA0CCTL0
#define TA0CCTL0 0x0162
#endif
#ifndef MC_UPTO_CCR0
#define MC_UPTO_CCR0 MC_1
#endif
#ifndef TBSSEL0
#define TBSSEL0 0x0100
#endif
#ifndef TBSSEL1
#define TBSSEL1 0x0200
#endif
#ifndef TBSSEL2
#define TBSSEL2 0x0400
#endif
#ifndef TA0CCTL1_
#define TA0CCTL1_ 0x0164
#endif
#ifndef TA0CCTL1
#define TA0CCTL1 0x0164
#endif
#ifndef CAREF_0
#define CAREF_0 0x00
#endif
#ifndef CAREF_1
#define CAREF_1 0x10
#endif
#ifndef CAREF_2
#define CAREF_2 0x20
#endif
#ifndef CAREF_3
#define CAREF_3 0x30
#endif
#ifndef __IOMACROS_H_
#define __IOMACROS_H_ 
#endif
#ifndef __IOMACROS_H
#define __IOMACROS_H 
#endif
#ifndef TA0CCTL2_
#define TA0CCTL2_ 0x0166
#endif
#ifndef TA0CCTL2
#define TA0CCTL2 0x0166
#endif
#ifndef U0CTL_
#define U0CTL_ 0x0070
#endif
#ifndef U0CTL
#define U0CTL 0x0070
#endif
#ifndef __msp430_headers_common_h
#define __msp430_headers_common_h 
#endif
#ifndef SHT1_DIV768
#define SHT1_DIV768 SHT1_11
#endif
#ifndef UCTL_
#define UCTL_ 0x0070
#endif
#ifndef UCTL
#define UCTL 0x0070
#endif
#ifndef SHT1_DIV1024
#define SHT1_DIV1024 SHT1_12
#endif
#ifndef P4IN_
#define P4IN_ 0x001C
#endif
#ifndef P4IN
#define P4IN 0x001C
#endif
#ifndef VLDOFF
#define VLDOFF 0x00
#endif
#ifndef CARSEL
#define CARSEL 0x40
#endif
#ifndef SREF_VREF_AVSS
#define SREF_VREF_AVSS SREF_1
#endif
#ifndef ADC12_VECTOR
#define ADC12_VECTOR 14
#endif
#ifndef ADC12TOVIE
#define ADC12TOVIE 0x0004
#endif
#ifndef UCTL_0_
#define UCTL_0_ 0x0070
#endif
#ifndef UCTL_0
#define UCTL_0 0x0070
#endif
#ifndef OAIE
#define OAIE 0x04
#endif
#ifndef TACCR0
#define TACCR0 TA0CCR0
#endif
#ifndef TACCR1
#define TACCR1 TA0CCR1
#endif
#ifndef TACCR2
#define TACCR2 TA0CCR2
#endif
#ifndef INCH_10
#define INCH_10 10
#endif
#ifndef INCH_11
#define INCH_11 11
#endif
#ifndef INCH_12
#define INCH_12 12
#endif
#ifndef INCH_13
#define INCH_13 13
#endif
#ifndef INCH_14
#define INCH_14 14
#endif
#ifndef INCH_15
#define INCH_15 15
#endif
#ifndef TXRDYIFG
#define TXRDYIFG 0x20
#endif
#ifndef P1OUT_
#define P1OUT_ 0x0021
#endif
#ifndef P1OUT
#define P1OUT 0x0021
#endif
#ifndef ALIE
#define ALIE 0x01
#endif
#ifndef DMACTL0_
#define DMACTL0_ 0x0122
#endif
#ifndef DMACTL0
#define DMACTL0 0x0122
#endif
#ifndef __DEC64_EPSILON__
#define __DEC64_EPSILON__ 1E-15DD
#endif
#ifndef __DEC64_EPSILON_
#define __DEC64_EPSILON_ 1E-15DD
#endif
#ifndef DMACTL1_
#define DMACTL1_ 0x0124
#endif
#ifndef DMACTL1
#define DMACTL1 0x0124
#endif
#ifndef USART0RX_VECTOR
#define USART0RX_VECTOR 18
#endif
#ifndef I2CSSEL_UCLK
#define I2CSSEL_UCLK I2CSSEL_0
#endif
#ifndef SYNC
#define SYNC 0x04
#endif
#ifndef P1SEL_
#define P1SEL_ 0x0026
#endif
#ifndef P1SEL
#define P1SEL 0x0026
#endif
#ifndef OUT
#define OUT 0x0004
#endif
#ifndef CM_POS
#define CM_POS CM_1
#endif
#ifndef SHT1_DIV512
#define SHT1_DIV512 SHT1_10
#endif
#ifndef ADC12SSEL_ADC12OSC
#define ADC12SSEL_ADC12OSC ADC12SSEL_0
#endif
#ifndef FSSEL_SMCLK
#define FSSEL_SMCLK FSSEL_2
#endif
#ifndef TASSEL_SMCLK
#define TASSEL_SMCLK TASSEL_2
#endif
#ifndef __SIZE_TYPE__
#define __SIZE_TYPE__ unsigned int
#endif
#ifndef __SIZE_TYPE_
#define __SIZE_TYPE_ unsigned int
#endif
#ifndef __MSP430_HAS_PORT5__
#define __MSP430_HAS_PORT5__ 
#endif
#ifndef __MSP430_HAS_PORT5_
#define __MSP430_HAS_PORT5_ 
#endif
#ifndef UBR00_
#define UBR00_ 0x0074
#endif
#ifndef UBR00
#define UBR00 0x0074
#endif
#ifndef TBCLR
#define TBCLR 0x0004
#endif
#ifndef DMA1TSEL0
#define DMA1TSEL0 0x0010
#endif
#ifndef DMA1TSEL1
#define DMA1TSEL1 0x0020
#endif
#ifndef DMA1TSEL2
#define DMA1TSEL2 0x0040
#endif
#ifndef U0TCTL_
#define U0TCTL_ 0x0071
#endif
#ifndef U0TCTL
#define U0TCTL 0x0071
#endif
#ifndef UBR0_0_
#define UBR0_0_ 0x0074
#endif
#ifndef UBR0_0
#define UBR0_0 0x0074
#endif
#ifndef ADC12SC
#define ADC12SC 0x0001
#endif
#ifndef SSEL_SMCLK
#define SSEL_SMCLK SSEL_2
#endif
#ifndef LPM0
#define LPM0 CPUOFF
#endif
#ifndef LPM1
#define LPM1 SCG0+CPUOFF
#endif
#ifndef LPM2
#define LPM2 SCG1+CPUOFF
#endif
#ifndef LPM3
#define LPM3 SCG1+SCG0+CPUOFF
#endif
#ifndef LPM4
#define LPM4 SCG1+SCG0+OSCOFF+CPUOFF
#endif
#ifndef TBCCR0_
#define TBCCR0_ 0x0192
#endif
#ifndef TBCCR0
#define TBCCR0 0x0192
#endif
#ifndef TBIE
#define TBIE 0x0002
#endif
#ifndef I2CTCTL_
#define I2CTCTL_ 0x0071
#endif
#ifndef I2CTCTL
#define I2CTCTL 0x0071
#endif
#ifndef SELM_LFXTCLK
#define SELM_LFXTCLK SELM_3
#endif
#ifndef __FLT_RADIX__
#define __FLT_RADIX__ 2
#endif
#ifndef __FLT_RADIX_
#define __FLT_RADIX_ 2
#endif
#ifndef DMA1DA_
#define DMA1DA_ 0x01EC
#endif
#ifndef DMA1DA
#define DMA1DA 0x01EC
#endif
#ifndef TIMERB0_VECTOR
#define TIMERB0_VECTOR 26
#endif
#ifndef __LDBL_EPSILON__
#define __LDBL_EPSILON__ 1.19209290e-7L
#endif
#ifndef __LDBL_EPSILON_
#define __LDBL_EPSILON_ 1.19209290e-7L
#endif
#ifndef ADC12MEM2_
#define ADC12MEM2_ 0x0144
#endif
#ifndef ADC12MEM2
#define ADC12MEM2 0x0144
#endif
#ifndef OUTMOD_RESET
#define OUTMOD_RESET OUTMOD_5
#endif
#ifndef INCH_A1
#define INCH_A1 1
#endif
#ifndef INCH_A2
#define INCH_A2 2
#endif
#ifndef INCH_A3
#define INCH_A3 3
#endif
#ifndef INCH_A4
#define INCH_A4 4
#endif
#ifndef INCH_A5
#define INCH_A5 5
#endif
#ifndef INCH_A6
#define INCH_A6 6
#endif
#ifndef SHP
#define SHP 0x0200
#endif
#ifndef ACCVIFG
#define ACCVIFG 0x0004
#endif
#ifndef __msp430_headers_clock_h
#define __msp430_headers_clock_h 
#endif
#ifndef TACTL
#define TACTL TA0CTL
#endif
#ifndef CM_NEG
#define CM_NEG CM_2
#endif
#ifndef __SIZEOF_PTRDIFF_T__
#define __SIZEOF_PTRDIFF_T__ 4
#endif
#ifndef __SIZEOF_PTRDIFF_T_
#define __SIZEOF_PTRDIFF_T_ 4
#endif
#ifndef FXKEY
#define FXKEY 0x3300
#endif
#ifndef I2CBB
#define I2CBB 0x01
#endif
#ifndef SCS
#define SCS 0x0800
#endif
#ifndef REFON
#define REFON 0x0020
#endif
#ifndef PORON
#define PORON 0x08
#endif
#ifndef TBR_
#define TBR_ 0x0190
#endif
#ifndef TBR
#define TBR 0x0190
#endif
#ifndef MOD0
#define MOD0 0x01
#endif
#ifndef MOD1
#define MOD1 0x02
#endif
#ifndef MOD2
#define MOD2 0x04
#endif
#ifndef MOD3
#define MOD3 0x08
#endif
#ifndef MOD4
#define MOD4 0x10
#endif
#ifndef SPB
#define SPB 0x20
#endif
#ifndef I2CEN
#define I2CEN 0x01
#endif
#ifndef __DEC32_SUBNORMAL_MIN__
#define __DEC32_SUBNORMAL_MIN__ 0.000001E-95DF
#endif
#ifndef __DEC32_SUBNORMAL_MIN_
#define __DEC32_SUBNORMAL_MIN_ 0.000001E-95DF
#endif
#ifndef SREF_VEREF_VEREF
#define SREF_VEREF_VEREF SREF_6
#endif
#ifndef NMI_VECTOR
#define NMI_VECTOR 28
#endif
#ifndef TAIV_CCR1
#define TAIV_CCR1 0x02
#endif
#ifndef I2CIV_RXRDY
#define I2CIV_RXRDY 0x0A
#endif
#ifndef SREF_VREF_VEREF
#define SREF_VREF_VEREF SREF_5
#endif
#ifndef __MSP430F110__
#define __MSP430F110__ 1
#endif
#ifndef __MSP430F110_
#define __MSP430F110_ 1
#endif
#ifndef STC
#define STC 0x02
#endif
#ifndef __FLT_HAS_QUIET_NAN__
#define __FLT_HAS_QUIET_NAN__ 1
#endif
#ifndef __FLT_HAS_QUIET_NAN_
#define __FLT_HAS_QUIET_NAN_ 1
#endif
#ifndef __FLT_MAX_10_EXP__
#define __FLT_MAX_10_EXP__ 38
#endif
#ifndef __FLT_MAX_10_EXP_
#define __FLT_MAX_10_EXP_ 38
#endif
#ifndef SHT0_DIV8
#define SHT0_DIV8 SHT0_1
#endif
#ifndef IE1_
#define IE1_ 0x0000
#endif
#ifndef IE1
#define IE1 0x0000
#endif
#ifndef SHT0_DIV128
#define SHT0_DIV128 SHT0_6
#endif
#ifndef __LONG_MAX__
#define __LONG_MAX__ 2147483647L
#endif
#ifndef __LONG_MAX_
#define __LONG_MAX_ 2147483647L
#endif
#ifndef __DEC128_SUBNORMAL_MIN__
#define __DEC128_SUBNORMAL_MIN__ 0.000000000000000000000000000000001E-6143DL
#endif
#ifndef __DEC128_SUBNORMAL_MIN_
#define __DEC128_SUBNORMAL_MIN_ 0.000000000000000000000000000000001E-6143DL
#endif
#ifndef __FLT_HAS_INFINITY__
#define __FLT_HAS_INFINITY__ 1
#endif
#ifndef __FLT_HAS_INFINITY_
#define __FLT_HAS_INFINITY_ 1
#endif
#ifndef TASSEL_INCLK
#define TASSEL_INCLK TASSEL_3
#endif
#ifndef U0TXBUF_
#define U0TXBUF_ 0x0077
#endif
#ifndef U0TXBUF
#define U0TXBUF 0x0077
#endif
#ifndef __DEC64_MAX__
#define __DEC64_MAX__ 9.999999999999999E384DD
#endif
#ifndef __DEC64_MAX_
#define __DEC64_MAX_ 9.999999999999999E384DD
#endif
#ifndef TIMERA1_VECTOR
#define TIMERA1_VECTOR 10
#endif
#ifndef __CHAR16_TYPE__
#define __CHAR16_TYPE__ short unsigned int
#endif
#ifndef __CHAR16_TYPE_
#define __CHAR16_TYPE_ short unsigned int
#endif
#ifndef TA0CCR0_
#define TA0CCR0_ 0x0172
#endif
#ifndef TA0CCR0
#define TA0CCR0 0x0172
#endif
#ifndef __PRAGMA_REDEFINE_EXTNAME
#define __PRAGMA_REDEFINE_EXTNAME 1
#endif
#ifndef SHS0
#define SHS0 0x0400
#endif
#ifndef TA0CCR1_
#define TA0CCR1_ 0x0174
#endif
#ifndef TA0CCR1
#define TA0CCR1 0x0174
#endif
#ifndef DMA2TSEL0
#define DMA2TSEL0 0x0100
#endif
#ifndef DMA2TSEL1
#define DMA2TSEL1 0x0200
#endif
#ifndef DMA2TSEL2
#define DMA2TSEL2 0x0400
#endif
#ifndef DMA2TSEL3
#define DMA2TSEL3 0x0800
#endif
#ifndef DMADT0
#define DMADT0 0x1000
#endif
#ifndef DMADT1
#define DMADT1 0x2000
#endif
#ifndef DMADT2
#define DMADT2 0x4000
#endif
#ifndef OUTMOD_OUT
#define OUTMOD_OUT OUTMOD_0
#endif
#ifndef __DEC64_MANT_DIG__
#define __DEC64_MANT_DIG__ 16
#endif
#ifndef __DEC64_MANT_DIG_
#define __DEC64_MANT_DIG_ 16
#endif
#ifndef TA0CCR2_
#define TA0CCR2_ 0x0176
#endif
#ifndef TA0CCR2
#define TA0CCR2 0x0176
#endif
#ifndef FSSEL_MCLK
#define FSSEL_MCLK FSSEL_1
#endif
#ifndef SHT0_DIV192
#define SHT0_DIV192 SHT0_7
#endif
#ifndef WDT_VECTOR
#define WDT_VECTOR 20
#endif
#ifndef ROUNDROBIN
#define ROUNDROBIN 0x0002
#endif
#ifndef __DEC32_MAX_EXP__
#define __DEC32_MAX_EXP__ 97
#endif
#ifndef __DEC32_MAX_EXP_
#define __DEC32_MAX_EXP_ 97
#endif
#ifndef I2CRM
#define I2CRM 0x40
#endif
#ifndef U0IFG
#define U0IFG IFG1
#endif
#ifndef XT2OFF
#define XT2OFF 0x80
#endif
#ifndef SHT0_DIV16
#define SHT0_DIV16 SHT0_2
#endif
#ifndef OUTMOD_SET
#define OUTMOD_SET OUTMOD_1
#endif
#ifndef SHT0_DIV32
#define SHT0_DIV32 SHT0_3
#endif
#ifndef CAREF_VT
#define CAREF_VT CAREF_3
#endif
#ifndef STTIFG
#define STTIFG 0x80
#endif
#ifndef __LDBL_MANT_DIG__
#define __LDBL_MANT_DIG__ 24
#endif
#ifndef __LDBL_MANT_DIG_
#define __LDBL_MANT_DIG_ 24
#endif
#ifndef CONSEQ_SEQUENCE
#define CONSEQ_SEQUENCE CONSEQ_1
#endif
#ifndef SLSHR0
#define SLSHR0 0x0200
#endif
#ifndef SLSHR1
#define SLSHR1 0x0400
#endif
#ifndef __MSP430_HAS_FLASH__
#define __MSP430_HAS_FLASH__ 
#endif
#ifndef __MSP430_HAS_FLASH_
#define __MSP430_HAS_FLASH_ 
#endif
#ifndef __DBL_HAS_QUIET_NAN__
#define __DBL_HAS_QUIET_NAN__ 1
#endif
#ifndef __DBL_HAS_QUIET_NAN_
#define __DBL_HAS_QUIET_NAN_ 1
#endif
#ifndef STTIE
#define STTIE 0x80
#endif
#ifndef SHT0_DIV64
#define SHT0_DIV64 SHT0_4
#endif
#ifndef U0RCTL_
#define U0RCTL_ 0x0072
#endif
#ifndef U0RCTL
#define U0RCTL 0x0072
#endif
#ifndef ADC12CTL1_
#define ADC12CTL1_ 0x01A2
#endif
#ifndef ADC12CTL1
#define ADC12CTL1 0x01A2
#endif
#ifndef __WCHAR_TYPE__
#define __WCHAR_TYPE__ int
#endif
#ifndef __WCHAR_TYPE_
#define __WCHAR_TYPE_ int
#endif
#ifndef __SIZEOF_FLOAT__
#define __SIZEOF_FLOAT__ 4
#endif
#ifndef __SIZEOF_FLOAT_
#define __SIZEOF_FLOAT_ 4
#endif
#ifndef UMCTL_0_
#define UMCTL_0_ 0x0073
#endif
#ifndef UMCTL_0
#define UMCTL_0 0x0073
#endif
#ifndef SHT0_DIV96
#define SHT0_DIV96 SHT0_5
#endif
#ifndef WRT
#define WRT 0x0040
#endif
#ifndef CAREF_025
#define CAREF_025 CAREF_1
#endif
#ifndef CONSEQ_SINGLE
#define CONSEQ_SINGLE CONSEQ_0
#endif
#ifndef WDTPW
#define WDTPW 0x5A00
#endif
#ifndef CAREF0
#define CAREF0 0x10
#endif
#ifndef CAREF1
#define CAREF1 0x20
#endif
#ifndef VLD_1_8V
#define VLD_1_8V 0x10
#endif
#ifndef ADC12MEM4_
#define ADC12MEM4_ 0x0148
#endif
#ifndef ADC12MEM4
#define ADC12MEM4 0x0148
#endif
#ifndef SHT0_DIV512
#define SHT0_DIV512 SHT0_10
#endif
#ifndef U0ME
#define U0ME ME1
#endif
#ifndef SREF_VEREF_AVSS
#define SREF_VEREF_AVSS SREF_2
#endif
#ifndef __FLT_DIG__
#define __FLT_DIG__ 6
#endif
#ifndef __FLT_DIG_
#define __FLT_DIG_ 6
#endif
#ifndef __MSP430_HAS_PORT2__
#define __MSP430_HAS_PORT2__ 
#endif
#ifndef __MSP430_HAS_PORT2_
#define __MSP430_HAS_PORT2_ 
#endif
#ifndef __MSPGCC__
#define __MSPGCC__ 20110706
#endif
#ifndef __MSPGCC_
#define __MSPGCC_ 20110706
#endif
#ifndef CAREF_050
#define CAREF_050 CAREF_2
#endif
#ifndef __INT_MAX__
#define __INT_MAX__ 32767
#endif
#ifndef __INT_MAX_
#define __INT_MAX_ 32767
#endif
#ifndef SHT1_DIV256
#define SHT1_DIV256 SHT1_8
#endif
#ifndef TXBUF0_
#define TXBUF0_ 0x0077
#endif
#ifndef TXBUF0
#define TXBUF0 0x0077
#endif
#ifndef CNTL0
#define CNTL0 0x0800
#endif
#ifndef CNTL1
#define CNTL1 0x1000
#endif
#ifndef UART0RX_VECTOR
#define UART0RX_VECTOR USART0RX_VECTOR
#endif
#ifndef I2CDCTL_
#define I2CDCTL_ 0x0072
#endif
#ifndef I2CDCTL
#define I2CDCTL 0x0072
#endif
#ifndef BCSCTL2_
#define BCSCTL2_ 0x0058
#endif
#ifndef BCSCTL2
#define BCSCTL2 0x0058
#endif
#ifndef DAC12RES
#define DAC12RES 0x1000
#endif
#ifndef P2IE_
#define P2IE_ 0x002D
#endif
#ifndef P2IE
#define P2IE 0x002D
#endif
#ifndef PEV
#define PEV 0x40
#endif
#ifndef __FLT_MAX_EXP__
#define __FLT_MAX_EXP__ 128
#endif
#ifndef __FLT_MAX_EXP_
#define __FLT_MAX_EXP_ 128
#endif
#ifndef I2C
#define I2C 0x20
#endif
#ifndef SHT0_DIV1024
#define SHT0_DIV1024 SHT0_12
#endif
#ifndef SHS_TBCCR0
#define SHS_TBCCR0 SHS_2
#endif
#ifndef SHS_TBCCR1
#define SHS_TBCCR1 SHS_3
#endif
#ifndef __DBL_MANT_DIG__
#define __DBL_MANT_DIG__ 24
#endif
#ifndef __DBL_MANT_DIG_
#define __DBL_MANT_DIG_ 24
#endif
#ifndef RXBUF0_
#define RXBUF0_ 0x0076
#endif
#ifndef RXBUF0
#define RXBUF0 0x0076
#endif
#ifndef __DEC64_MIN__
#define __DEC64_MIN__ 1E-383DD
#endif
#ifndef __DEC64_MIN_
#define __DEC64_MIN_ 1E-383DD
#endif
#ifndef __WINT_TYPE__
#define __WINT_TYPE__ unsigned int
#endif
#ifndef __WINT_TYPE_
#define __WINT_TYPE_ unsigned int
#endif
#ifndef __SIZEOF_SHORT__
#define __SIZEOF_SHORT__ 2
#endif
#ifndef __SIZEOF_SHORT_
#define __SIZEOF_SHORT_ 2
#endif
#ifndef CAOUT
#define CAOUT 0x01
#endif
#ifndef I2COA_
#define I2COA_ 0x0118
#endif
#ifndef I2COA
#define I2COA 0x0118
#endif
#ifndef SELM_DCOCLK
#define SELM_DCOCLK SELM_0
#endif
#ifndef ENC
#define ENC 0x0002
#endif
#ifndef __msp430_headers_gpio_h
#define __msp430_headers_gpio_h 
#endif
#ifndef IFG1_
#define IFG1_ 0x0002
#endif
#ifndef IFG1
#define IFG1 0x0002
#endif
#ifndef CCIFG
#define CCIFG 0x0001
#endif
#ifndef CCIE
#define CCIE 0x0010
#endif
#ifndef EOS
#define EOS 0x80
#endif
#ifndef ARDYIE
#define ARDYIE 0x08
#endif
#ifndef ADC12MCTL
#define ADC12MCTL ADC12MCTL_
#endif
#ifndef ADC12BUSY
#define ADC12BUSY 0x0001
#endif
#ifndef __LDBL_MAX_10_EXP__
#define __LDBL_MAX_10_EXP__ 38
#endif
#ifndef __LDBL_MAX_10_EXP_
#define __LDBL_MAX_10_EXP_ 38
#endif
#ifndef P2IN_
#define P2IN_ 0x0028
#endif
#ifndef P2IN
#define P2IN 0x0028
#endif
#ifndef DMA1SZ_
#define DMA1SZ_ 0x01EE
#endif
#ifndef DMA1SZ
#define DMA1SZ 0x01EE
#endif
#ifndef DAC12GRP
#define DAC12GRP 0x0001
#endif
#ifndef DMA1SA_
#define DMA1SA_ 0x01EA
#endif
#ifndef DMA1SA
#define DMA1SA 0x01EA
#endif
#ifndef FE
#define FE 0x80
#endif
#ifndef __MSP430_HAS_SVS__
#define __MSP430_HAS_SVS__ 
#endif
#ifndef __MSP430_HAS_SVS_
#define __MSP430_HAS_SVS_ 
#endif
#ifndef ME1_
#define ME1_ 0x0004
#endif
#ifndef ME1
#define ME1 0x0004
#endif
#ifndef __SIZEOF_WCHAR_T__
#define __SIZEOF_WCHAR_T__ 2
#endif
#ifndef __SIZEOF_WCHAR_T_
#define __SIZEOF_WCHAR_T_ 2
#endif
#ifndef CLLD0
#define CLLD0 0x0200
#endif
#ifndef CLLD1
#define CLLD1 0x0400
#endif
#ifndef OUTMOD_SET_RESET
#define OUTMOD_SET_RESET OUTMOD_3
#endif
#ifndef TXRDYIE
#define TXRDYIE 0x20
#endif
#ifndef CONSEQ_REPEAT_SINGLE
#define CONSEQ_REPEAT_SINGLE CONSEQ_2
#endif
#ifndef CONSEQ0
#define CONSEQ0 0x0002
#endif
#ifndef CONSEQ1
#define CONSEQ1 0x0004
#endif
#ifndef OUTMOD_TOGGLE_SET
#define OUTMOD_TOGGLE_SET OUTMOD_6
#endif
#ifndef CCTL0
#define CCTL0 TA0CCTL0
#endif
#ifndef CCTL1
#define CCTL1 TA0CCTL1
#endif
#ifndef CCTL2
#define CCTL2 TA0CCTL2
#endif
#ifndef CCR0
#define CCR0 TA0CCR0
#endif
#ifndef CCR1
#define CCR1 TA0CCR1
#endif
#ifndef CCR2
#define CCR2 TA0CCR2
#endif
#ifndef __MSP430_HAS_TB3__
#define __MSP430_HAS_TB3__ 
#endif
#ifndef __MSP430_HAS_TB3_
#define __MSP430_HAS_TB3_ 
#endif
#ifndef SHT0_DIV4
#define SHT0_DIV4 SHT0_0
#endif
#ifndef ADC_VECTOR
#define ADC_VECTOR ADC12_VECTOR
#endif
#ifndef MM
#define MM 0x02
#endif
#ifndef RXRDYIE
#define RXRDYIE 0x10
#endif
#ifndef I2CDR_
#define I2CDR_ 0x0076
#endif
#ifndef I2CDR
#define I2CDR 0x0076
#endif
#ifndef ID0
#define ID0 0x0040
#endif
#ifndef ID1
#define ID1 0x0080
#endif
#ifndef CCIS0
#define CCIS0 0x1000
#endif
#ifndef CCIS1
#define CCIS1 0x2000
#endif
#ifndef __MSP430_HAS_PORT6__
#define __MSP430_HAS_PORT6__ 
#endif
#ifndef __MSP430_HAS_PORT6_
#define __MSP430_HAS_PORT6_ 
#endif
#ifndef UBR10_
