jankaluza/qsimkit/QSimKit/MCU/MSP430/CPU/Variants/msp430x15x.cpp
#define UBR10_ 0x0075
#endif
#ifndef UBR10
#define UBR10 0x0075
#endif
#ifndef TAR
#define TAR TA0R
#endif
#ifndef OE
#define OE 0x20
#endif
#ifndef __DEC_EVAL_METHOD__
#define __DEC_EVAL_METHOD__ 2
#endif
#ifndef __DEC_EVAL_METHOD_
#define __DEC_EVAL_METHOD_ 2
#endif
#ifndef INCH_VEREF_MINUS
#define INCH_VEREF_MINUS 9
#endif
#ifndef PE
#define PE 0x40
#endif
#ifndef NACKIFG
#define NACKIFG 0x02
#endif
#ifndef WDTTMSEL
#define WDTTMSEL 0x0010
#endif
#ifndef DIVS_DIV1
#define DIVS_DIV1 DIVS_0
#endif
#ifndef DIVS_DIV2
#define DIVS_DIV2 DIVS_1
#endif
#ifndef DIVS_DIV4
#define DIVS_DIV4 DIVS_2
#endif
#ifndef DIVS_DIV8
#define DIVS_DIV8 DIVS_3
#endif
#ifndef TAIE
#define TAIE 0x0002
#endif
#ifndef ERASE
#define ERASE 0x0002
#endif
#ifndef I2CMM_0
#define I2CMM_0 0
#endif
#ifndef XT5V
#define XT5V 0x08
#endif
#ifndef __INTMAX_MAX__
#define __INTMAX_MAX__ 9223372036854775807LL
#endif
#ifndef __INTMAX_MAX_
#define __INTMAX_MAX_ 9223372036854775807LL
#endif
#ifndef CONSEQ_REPEAT_SEQUENCE
#define CONSEQ_REPEAT_SEQUENCE CONSEQ_3
#endif
#ifndef __FLT_DENORM_MIN__
#define __FLT_DENORM_MIN__ 1.40129846e-45F
#endif
#ifndef __FLT_DENORM_MIN_
#define __FLT_DENORM_MIN_ 1.40129846e-45F
#endif
#ifndef P5IN_
#define P5IN_ 0x0030
#endif
#ifndef P5IN
#define P5IN 0x0030
#endif
#ifndef UTCTL_
#define UTCTL_ 0x0071
#endif
#ifndef UTCTL
#define UTCTL 0x0071
#endif
#ifndef INCH_TEMP
#define INCH_TEMP 10
#endif
#ifndef URCTL0_
#define URCTL0_ 0x0072
#endif
#ifndef URCTL0
#define URCTL0 0x0072
#endif
#ifndef I2CSA_
#define I2CSA_ 0x011A
#endif
#ifndef I2CSA
#define I2CSA 0x011A
#endif
#ifndef UCTL0_
#define UCTL0_ 0x0070
#endif
#ifndef UCTL0
#define UCTL0 0x0070
#endif
#ifndef I2CSBD
#define I2CSBD 0x08
#endif
#ifndef XA
#define XA 0x10
#endif
#ifndef __CHAR32_TYPE__
#define __CHAR32_TYPE__ unsigned int
#endif
#ifndef __CHAR32_TYPE_
#define __CHAR32_TYPE_ unsigned int
#endif
#ifndef __FLT_MAX__
#define __FLT_MAX__ 3.40282347e+38F
#endif
#ifndef __FLT_MAX_
#define __FLT_MAX_ 3.40282347e+38F
#endif
#ifndef SREF_AVCC_AVSS
#define SREF_AVCC_AVSS SREF_0
#endif
#ifndef TBCLGRP0
#define TBCLGRP0 0x2000
#endif
#ifndef TBCLGRP1
#define TBCLGRP1 0x4000
#endif
#ifndef TAIV_
#define TAIV_ TA0IV_
#endif
#ifndef TAIV
#define TAIV TA0IV_
#endif
#ifndef __SIZEOF_DOUBLE__
#define __SIZEOF_DOUBLE__ 4
#endif
#ifndef __SIZEOF_DOUBLE_
#define __SIZEOF_DOUBLE_ 4
#endif
#ifndef ADC12MEM0_
#define ADC12MEM0_ ADC12MEM_
#endif
#ifndef ADC12MEM0
#define ADC12MEM0 ADC12MEM_
#endif
#ifndef I2CDRB_
#define I2CDRB_ 0x0076
#endif
#ifndef I2CDRB
#define I2CDRB 0x0076
#endif
#ifndef DMADSTBYTE
#define DMADSTBYTE 0x0080
#endif
#ifndef I2CRXOVR
#define I2CRXOVR 0x02
#endif
#ifndef WDTHOLD
#define WDTHOLD 0x0080
#endif
#ifndef __INTMAX_TYPE__
#define __INTMAX_TYPE__ long long int
#endif
#ifndef __INTMAX_TYPE_
#define __INTMAX_TYPE_ long long int
#endif
#ifndef ADC12MEM1_
#define ADC12MEM1_ 0x0142
#endif
#ifndef ADC12MEM1
#define ADC12MEM1 0x0142
#endif
#ifndef __DEC128_MAX_EXP__
#define __DEC128_MAX_EXP__ 6145
#endif
#ifndef __DEC128_MAX_EXP_
#define __DEC128_MAX_EXP_ 6145
#endif
#ifndef I2CSSEL_SMCLK
#define I2CSSEL_SMCLK I2CSSEL_2
#endif
#ifndef SHR0
#define SHR0 0x2000
#endif
#ifndef SHR1
#define SHR1 0x4000
#endif
#ifndef ADC12MEM3_
#define ADC12MEM3_ 0x0146
#endif
#ifndef ADC12MEM3
#define ADC12MEM3 0x0146
#endif
#ifndef SHS1
#define SHS1 0x0800
#endif
#ifndef __GNUC_MINOR__
#define __GNUC_MINOR__ 5
#endif
#ifndef __GNUC_MINOR_
#define __GNUC_MINOR_ 5
#endif
#ifndef __UINTMAX_MAX__
#define __UINTMAX_MAX__ 18446744073709551615ULL
#endif
#ifndef __UINTMAX_MAX_
#define __UINTMAX_MAX_ 18446744073709551615ULL
#endif
#ifndef __DEC32_MANT_DIG__
#define __DEC32_MANT_DIG__ 7
#endif
#ifndef __DEC32_MANT_DIG_
#define __DEC32_MANT_DIG_ 7
#endif
#ifndef COMPARATORA_VECTOR
#define COMPARATORA_VECTOR 22
#endif
#ifndef ADC12MEM5_
#define ADC12MEM5_ 0x014A
#endif
#ifndef ADC12MEM5
#define ADC12MEM5 0x014A
#endif
#ifndef __DBL_MAX_10_EXP__
#define __DBL_MAX_10_EXP__ 38
#endif
#ifndef __DBL_MAX_10_EXP_
#define __DBL_MAX_10_EXP_ 38
#endif
#ifndef __LDBL_DENORM_MIN__
#define __LDBL_DENORM_MIN__ 1.40129846e-45L
#endif
#ifndef __LDBL_DENORM_MIN_
#define __LDBL_DENORM_MIN_ 1.40129846e-45L
#endif
#ifndef ADC12MEM6_
#define ADC12MEM6_ 0x014C
#endif
#ifndef ADC12MEM6
#define ADC12MEM6 0x014C
#endif
#ifndef I2CWORD
#define I2CWORD 0x80
#endif
#ifndef ADC12MEM7_
#define ADC12MEM7_ 0x014E
#endif
#ifndef ADC12MEM7
#define ADC12MEM7 0x014E
#endif
#ifndef SHT1_DIV4
#define SHT1_DIV4 SHT1_0
#endif
#ifndef TACCTL0_
#define TACCTL0_ TA0CCTL0_
#endif
#ifndef TACCTL0
#define TACCTL0 TA0CCTL0_
#endif
#ifndef __STDC__
#define __STDC__ 1
#endif
#ifndef __STDC_
#define __STDC_ 1
#endif
#ifndef MC1
#define MC1 0x0020
#endif
#ifndef __MSP430_HAS_ADC12__
#define __MSP430_HAS_ADC12__ 
#endif
#ifndef __MSP430_HAS_ADC12_
#define __MSP430_HAS_ADC12_ 
#endif
#ifndef ADC12MEM8_
#define ADC12MEM8_ 0x0150
#endif
#ifndef ADC12MEM8
#define ADC12MEM8 0x0150
#endif
#ifndef __PTRDIFF_TYPE__
#define __PTRDIFF_TYPE__ long int
#endif
#ifndef __PTRDIFF_TYPE_
#define __PTRDIFF_TYPE_ long int
#endif
#ifndef UBR1_0_
#define UBR1_0_ 0x0075
#endif
#ifndef UBR1_0
#define UBR1_0 0x0075
#endif
#ifndef TACCTL1_
#define TACCTL1_ TA0CCTL1_
#endif
#ifndef TACCTL1
#define TACCTL1 TA0CCTL1_
#endif
#ifndef INCH_0
#define INCH_0 0
#endif
#ifndef INCH_1
#define INCH_1 1
#endif
#ifndef INCH_2
#define INCH_2 2
#endif
#ifndef INCH_3
#define INCH_3 3
#endif
#ifndef INCH_4
#define INCH_4 4
#endif
#ifndef INCH_5
#define INCH_5 5
#endif
#ifndef INCH_6
#define INCH_6 6
#endif
#ifndef INCH_7
#define INCH_7 7
#endif
#ifndef INCH_8
#define INCH_8 8
#endif
#ifndef INCH_9
#define INCH_9 9
#endif
#ifndef TAIV_OVERFLOW
#define TAIV_OVERFLOW 0x0A
#endif
#ifndef P2IES_
#define P2IES_ 0x002C
#endif
#ifndef P2IES
#define P2IES 0x002C
#endif
#ifndef ADC12MEM9_
#define ADC12MEM9_ 0x0152
#endif
#ifndef ADC12MEM9
#define ADC12MEM9 0x0152
#endif
#ifndef TACCTL2_
#define TACCTL2_ TA0CCTL2_
#endif
#ifndef TACCTL2
#define TACCTL2 TA0CCTL2_
#endif
#ifndef MSP430
#define MSP430 1
#endif
#ifndef DMA2DA_
#define DMA2DA_ 0x01F4
#endif
#ifndef DMA2DA
#define DMA2DA 0x01F4
#endif
#ifndef __msp430_headers_compa_h
#define __msp430_headers_compa_h 
#endif
#ifndef __msp430_headers_usart_h
#define __msp430_headers_usart_h 
#endif
#ifndef P6DIR_
#define P6DIR_ 0x0036
#endif
#ifndef P6DIR
#define P6DIR 0x0036
#endif
#ifndef TBIV_CCR1
#define TBIV_CCR1 0x02
#endif
#ifndef __DEC64_SUBNORMAL_MIN__
#define __DEC64_SUBNORMAL_MIN__ 0.000000000000001E-383DD
#endif
#ifndef __DEC64_SUBNORMAL_MIN_
#define __DEC64_SUBNORMAL_MIN_ 0.000000000000001E-383DD
#endif
#ifndef BCSCTL1_
#define BCSCTL1_ 0x0057
#endif
#ifndef BCSCTL1
#define BCSCTL1 0x0057
#endif
#ifndef __DEC128_MANT_DIG__
#define __DEC128_MANT_DIG__ 34
#endif
#ifndef __DEC128_MANT_DIG_
#define __DEC128_MANT_DIG_ 34
#endif
#ifndef __MSP430_CPU__
#define __MSP430_CPU__ 0
#endif
#ifndef __MSP430_CPU_
#define __MSP430_CPU_ 0
#endif
#ifndef I2CSTB
#define I2CSTB 0x04
#endif
#ifndef I2CSTP
#define I2CSTP 0x02
#endif
#ifndef I2CSTT
#define I2CSTT 0x01
#endif
#ifndef __SIZEOF_LONG_LONG__
#define __SIZEOF_LONG_LONG__ 8
#endif
#ifndef __SIZEOF_LONG_LONG_
#define __SIZEOF_LONG_LONG_ 8
#endif
#ifndef CM_DISABLE
#define CM_DISABLE CM_0
#endif
#ifndef __LDBL_DIG__
#define __LDBL_DIG__ 6
#endif
#ifndef __LDBL_DIG_
#define __LDBL_DIG_ 6
#endif
#ifndef OSCOFF
#define OSCOFF 0x0020
#endif
#ifndef ENNMI
#define ENNMI 0x0001
#endif
#ifndef __GNUC_GNU_INLINE__
#define __GNUC_GNU_INLINE__ 1
#endif
#ifndef __GNUC_GNU_INLINE_
#define __GNUC_GNU_INLINE_ 1
#endif
#ifndef TACCTL0
#define TACCTL0 TA0CCTL0
#endif
#ifndef TACCTL1
#define TACCTL1 TA0CCTL1
#endif
#ifndef TACCTL2
#define TACCTL2 TA0CCTL2
#endif
#ifndef WDTIS0
#define WDTIS0 0x0001
#endif
#ifndef WDTIS1
#define WDTIS1 0x0002
#endif
#ifndef INCH_A0
#define INCH_A0 0
#endif
#ifndef BRK
#define BRK 0x10
#endif
#ifndef CAPD0
#define CAPD0 0x01
#endif
#ifndef CAPD1
#define CAPD1 0x02
#endif
#ifndef CAPD2
#define CAPD2 0x04
#endif
#ifndef CAPD3
#define CAPD3 0x08
#endif
#ifndef CAPD4
#define CAPD4 0x10
#endif
#ifndef CAPD5
#define CAPD5 0x20
#endif
#ifndef CAPD6
#define CAPD6 0x40
#endif
#ifndef CAPD7
#define CAPD7 0x80
#endif
#ifndef INCH_A7
#define INCH_A7 7
#endif
#ifndef DMAIFG
#define DMAIFG 0x0008
#endif
#ifndef C
#define C 0x0001
#endif
#ifndef N
#define N 0x0004
#endif
#ifndef SHT1_DIV8
#define SHT1_DIV8 SHT1_1
#endif
#ifndef CAPD_
#define CAPD_ 0x005B
#endif
#ifndef CAPD
#define CAPD 0x005B
#endif
#ifndef V
#define V 0x0100
#endif
#ifndef Z
#define Z 0x0002
#endif
#include "CPU/Variants/Variant.h"
#include "CPU/Variants/VariantManager.h"

class Variant_msp430x15x : public Variant {
	public:
		Variant_msp430x15x() {}
		virtual ~Variant_msp430x15x() {}
		const char *getName() { return "msp430x15x"; }

		unsigned int getP1DIR() {
#ifdef P1DIR_
			return P1DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP1IE() {
#ifdef P1IE_
			return P1IE_;
#else
			return 0;
#endif
		}


